# 주석
'''
한줄 주석 : #
여러줄 주석 : [작은따음표or큰따음표]x3 내용 [작은따음표or큰따음표]x3
파이썬에선 주석도 들여쓰기를 맞춰서 해줘야한다 어떤 함수의 주석인지 확인하기 위해
'''

# dataType(자료형)
'''
정수 : int
실수 : float
문자열 : str
true, false : bool


list() : 리스트
    리스트명 = [요소1, 요소2, 요소3, ...]
    a = list()
    리스트안에 어떠한 자료형이든 포함가능
    a[-1] 이렇게 하면 마지막 요소 호출
    len(a) 길이 구하기

tuple() : 튜플
    리스트와 비슷하지만 ()로 생성
    t = (1, 2, 3, 4)
    t = (1, ) 1개 요소사용시 콤마가 꼭 필요
    튜플은 값이 변하지않는 고정된값을 사용할때 이용 

dict() : 딕셔너리
    Java HashMap처럼 Key : Value로 이루어짐
    d = {Key1 : Value1, Key2 : Value2, ...}
    데이터 추가 : d['name'] = 'Hyoboy'
    데이터 삭제 : del d['name']
'''
